app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "5"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sat, 08 Apr 2017 22:15:36 UTC +00:00], ["updated_at", Sat, 08 Apr 2017 22:15:36 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Sat, 08 Apr 2017 22:15:36 UTC +00:00], ["product_id", 5], ["updated_at", Sat, 08 Apr 2017 22:15:36 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 2  [["quantity", 2], ["updated_at", Tue, 11 Apr 2017 13:25:19 UTC +00:00]]
---
  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save