app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "description", "image_url", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 05 Apr 2017 08:10:27 UTC +00:00], ["description", "ff"], ["image_url", ""], ["title", "Ff"], ["updated_at", Wed, 05 Apr 2017 08:10:27 UTC +00:00]]
---
  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save

UPDATE "products" SET "title" = ?, "description" = ?, "image_url" = ?, "price" = ?, "updated_at" = ? WHERE "products"."id" = 980190962
---
  def update
    respond_to do |format|
      if @product.update(product_params)