app/controllers/store_controller.rb

  def index
    p 'ss'
    @products = Product.order(:title)
---
SELECT "products".* FROM "products" ORDER BY "products"."title" ASC